# Multivariate Linear Regression

Given file contains hiring statics for a firm such as experience of candidate, his written test score and personal interview score. Based on these 3 factors, HR will decide the salary. Given this data, you need to build a machine learning model for HR department that can help them decide salaries for future candidates. Using this predict salaries for following candidates,

**2 yr experience, 9 test score, 6 interview score**

**12 yr experience, 10 test score, 10 interview score**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

from sklearn import linear_model
from word2number import w2n

In [2]:
df = pd.read_csv('hiring.csv')
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

*We must prossess the training data before regression*

*First, find median of test_score and replace NaN with it.*

In [3]:
import math
score_median = math.floor(df.test_score.median())
df.test_score = df.test_score.fillna(score_median)

*Secondly, replace experience's NaN with word "zero" and then change words to numbers with python library 'word2number'.*

In [4]:
df.experience = df.experience.fillna('zero')
df.experience = df.experience.apply(w2n.word_to_num)
df

   experience  test_score  interview_score  salary
0           0         8.0                9   50000
1           0         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         8.0                7   72000
7          11         7.0                8   80000

*Now apply Linear Regression*

In [5]:
reg = linear_model.LinearRegression()
reg.fit(df[['experience','test_score','interview_score']],df[['salary']])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [6]:
reg.predict([[2,9,6]])

array([[53205.96797671]])

In [7]:
reg.predict([[12,10,10]])

array([[92002.18340611]])